---
title: SiteFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SiteFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 27
---

# SiteFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BuildingPadNotConnected { get; }` | `SiteFailures.BuildingPadNotConnected` | FailureDefinitionId |
| `FailureDefinitionId BuildingPadOverlap { get; }` | `SiteFailures.BuildingPadOverlap` | FailureDefinitionId |
| `FailureDefinitionId CannotComputeProperArea { get; }` | `SiteFailures.CannotComputeProperArea` | FailureDefinitionId |
| `FailureDefinitionId CannotIntersectSiteRegions { get; }` | `SiteFailures.CannotIntersectSiteRegions` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeSurface { get; }` | `SiteFailures.CannotMakeSurface` | FailureDefinitionId |
| `FailureDefinitionId ContourLabelEmpty { get; }` | `SiteFailures.ContourLabelEmpty` | FailureDefinitionId |
| `FailureDefinitionId EnterValueOrFormula { get; }` | `SiteFailures.EnterValueOrFormula` | FailureDefinitionId |
| `FailureDefinitionId GradingInSamePhase { get; }` | `SiteFailures.GradingInSamePhase` | FailureDefinitionId |
| `FailureDefinitionId NoHostForSubregion { get; }` | `SiteFailures.NoHostForSubregion` | FailureDefinitionId |
| `FailureDefinitionId NoHostForSubregionWarn { get; }` | `SiteFailures.NoHostForSubregionWarn` | FailureDefinitionId |
| `FailureDefinitionId NotEnoughPointsInSurface { get; }` | `SiteFailures.NotEnoughPointsInSurface` | FailureDefinitionId |
| `FailureDefinitionId PointNotInSurface { get; }` | `SiteFailures.PointNotInSurface` | FailureDefinitionId |
| `FailureDefinitionId PointRelativeOutside { get; }` | `SiteFailures.PointRelativeOutside` | FailureDefinitionId |
| `FailureDefinitionId PropertyIntersect { get; }` | `SiteFailures.PropertyIntersect` | FailureDefinitionId |
| `FailureDefinitionId RegionPhaseMismatch { get; }` | `SiteFailures.RegionPhaseMismatch` | FailureDefinitionId |
| `FailureDefinitionId ResetToposurfacePhaseCreated { get; }` | `SiteFailures.ResetToposurfacePhaseCreated` | FailureDefinitionId |
| `FailureDefinitionId SiteEditPointsClipped { get; }` | `SiteFailures.SiteEditPointsClipped` | FailureDefinitionId |
| `FailureDefinitionId SiteEditPointsInvisible { get; }` | `SiteFailures.SiteEditPointsInvisible` | FailureDefinitionId |
| `FailureDefinitionId SiteMergeDisconnected { get; }` | `SiteFailures.SiteMergeDisconnected` | FailureDefinitionId |
| `FailureDefinitionId SitePhasesDontOverlap { get; }` | `SiteFailures.SitePhasesDontOverlap` | FailureDefinitionId |
| `FailureDefinitionId SiteRegionOptionConflict { get; }` | `SiteFailures.SiteRegionOptionConflict` | FailureDefinitionId |
| `FailureDefinitionId SurfaceSelfIntersection { get; }` | `SiteFailures.SurfaceSelfIntersection` | FailureDefinitionId |
| `FailureDefinitionId SurfaceSplit { get; }` | `SiteFailures.SurfaceSplit` | FailureDefinitionId |
| `FailureDefinitionId SurfaceSplitError { get; }` | `SiteFailures.SurfaceSplitError` | FailureDefinitionId |
| `FailureDefinitionId SurfaceSplitNoIntersection { get; }` | `SiteFailures.SurfaceSplitNoIntersection` | FailureDefinitionId |
| `FailureDefinitionId SurfaceTriangulationFailed { get; }` | `SiteFailures.SurfaceTriangulationFailed` | FailureDefinitionId |
| `FailureDefinitionId ToposolidSlopeExceedsThreshold { get; }` | `SiteFailures.ToposolidSlopeExceedsThreshold` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```